 ## Terraform Results
#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_droplet.gate will be created
  + resource "digitalocean_droplet" "gate" {
      + backups              = true
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-22-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "gate"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "fra1"
      + resize_disk          = true
      + size                 = "s-1vcpu-1gb"
      + status               = (known after apply)
      + urn                  = (known after apply)
      + user_data            = "5c0193633192db75bfed5753c5c9423537911783"
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_reserved_ip.r_ipv4 will be created
  + resource "digitalocean_reserved_ip" "r_ipv4" {
      + droplet_id = (known after apply)
      + id         = (known after apply)
      + ip_address = (known after apply)
      + region     = "fra1"
      + urn        = (known after apply)
    }

  # digitalocean_vpc.gate_vpc will be created
  + resource "digitalocean_vpc" "gate_vpc" {
      + created_at = (known after apply)
      + default    = (known after apply)
      + id         = (known after apply)
      + ip_range   = "10.10.10.0/24"
      + name       = "gate-vpc"
      + region     = "fra1"
      + urn        = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + gate_ip = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

## Ansible Results

<details><summary>DryRun Output</summary>

```

Nothing in the Inventory.
```

*Pusher: @obiMadu, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*